---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.GetExposedFaces
source: html/2afebbf0-931a-353a-69c1-9aba76c33cc1.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.GetExposedFaces Method

Returns all the exposed faces, that is, those that have an associated CoverType.

## Syntax (C#)
```csharp
public IList<Reference> GetExposedFaces()
```